# GuidEnum Properties

---
The GuidEnum type exposes the following members.
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object.
Top
#### Reference
GuidEnum Class
Autodesk.Revit.DB Namespace